Catalogs/упСтатусыДокументовWMS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упСтатусыДокументовWMS</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПрименениеЗаявкаНаПеревозкуГруза</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименениеРейс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГотовКОтгрузке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/упСтатусыДокументовWMS/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс
	
// Процедура проводит начальное заполнение справочника
//
Процедура ПервоначальноеЗаполнение(Параметры = Неопределено) Экспорт
	
	текЭлемент = Справочники.упСтатусыДокументовWMS.НеЗагружен.ПолучитьОбъект();
	текЭлемент.ПрименениеЗаявкаНаПеревозкуГруза = Истина;
	текЭлемент.ПрименениеРейс                   = Ложь;
	текЭлемент.ГотовКОтгрузке                   = Ложь;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упСтатусыДокументовWMS.Новый.ПолучитьОбъект();
	текЭлемент.ПрименениеЗаявкаНаПеревозкуГруза = Истина;
	текЭлемент.ПрименениеРейс                   = Истина;
	текЭлемент.ГотовКОтгрузке                   = Ложь;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упСтатусыДокументовWMS.КВыполнению.ПолучитьОбъект();
	текЭлемент.ПрименениеЗаявкаНаПеревозкуГруза = Истина;
	текЭлемент.ПрименениеРейс                   = Истина;
	текЭлемент.ГотовКОтгрузке                   = Ложь;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упСтатусыДокументовWMS.СпланированЧастично.ПолучитьОбъект();
	текЭлемент.ПрименениеЗаявкаНаПеревозкуГруза = Истина;
	текЭлемент.ПрименениеРейс                   = Истина;
	текЭлемент.ГотовКОтгрузке                   = Ложь;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упСтатусыДокументовWMS.НеПересчитан.ПолучитьОбъект();
	текЭлемент.ПрименениеЗаявкаНаПеревозкуГруза = Ложь;
	текЭлемент.ПрименениеРейс                   = Ложь;
	текЭлемент.ГотовКОтгрузке                   = Ложь;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упСтатусыДокументовWMS.Спланирован.ПолучитьОбъект();
	текЭлемент.ПрименениеЗаявкаНаПеревозкуГруза = Истина;
	текЭлемент.ПрименениеРейс                   = Истина;
	текЭлемент.ГотовКОтгрузке                   = Ложь;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упСтатусыДокументовWMS.ГотовКОтбору.ПолучитьОбъект();
	текЭлемент.ПрименениеЗаявкаНаПеревозкуГруза = Истина;
	текЭлемент.ПрименениеРейс                   = Истина;
	текЭлемент.ГотовКОтгрузке                   = Ложь;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упСтатусыДокументовWMS.ВОтбор.ПолучитьОбъект();
	текЭлемент.ПрименениеЗаявкаНаПеревозкуГруза = Истина;
	текЭлемент.ПрименениеРейс                   = Истина;
	текЭлемент.ГотовКОтгрузке                   = Ложь;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упСтатусыДокументовWMS.ВОтборе.ПолучитьОбъект();
	текЭлемент.ПрименениеЗаявкаНаПеревозкуГруза = Ложь;
	текЭлемент.ПрименениеРейс                   = Ложь;
	текЭлемент.ГотовКОтгрузке                  = Ложь;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упСтатусыДокументовWMS.Принят.ПолучитьОбъект();
	текЭлемент.ПрименениеЗаявкаНаПеревозкуГруза = Ложь;
	текЭлемент.ПрименениеРейс                   = Ложь;
	текЭлемент.ГотовКОтгрузке                   = Ложь;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упСтатусыДокументовWMS.Промаркирован.ПолучитьОбъект();
	текЭлемент.ПрименениеЗаявкаНаПеревозкуГруза = Ложь;
	текЭлемент.ПрименениеРейс                   = Ложь;
	текЭлемент.ГотовКОтгрузке                   = Ложь;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упСтатусыДокументовWMS.Упакован.ПолучитьОбъект();
	текЭлемент.ПрименениеЗаявкаНаПеревозкуГруза = Истина;
	текЭлемент.ПрименениеРейс                   = Истина;
	текЭлемент.ГотовКОтгрузке                   = Ложь;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упСтатусыДокументовWMS.Проконтролирован.ПолучитьОбъект();
	текЭлемент.ПрименениеЗаявкаНаПеревозкуГруза = Истина;
	текЭлемент.ПрименениеРейс                   = Истина;
	текЭлемент.ГотовКОтгрузке                   = Ложь;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упСтатусыДокументовWMS.ГотовКОтгрузке.ПолучитьОбъект();
	текЭлемент.ПрименениеЗаявкаНаПеревозкуГруза = Истина;
	текЭлемент.ПрименениеРейс                   = Истина;
	текЭлемент.ГотовКОтгрузке                   = Истина;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упСтатусыДокументовWMS.Отгружен.ПолучитьОбъект();
	текЭлемент.ПрименениеЗаявкаНаПеревозкуГруза = Истина;
	текЭлемент.ПрименениеРейс                   = Истина;
	текЭлемент.ГотовКОтгрузке                   = Ложь;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упСтатусыДокументовWMS.Отменен.ПолучитьОбъект();
	текЭлемент.ПрименениеЗаявкаНаПеревозкуГруза = Истина;
	текЭлемент.ПрименениеРейс                   = Истина;
	текЭлемент.ГотовКОтгрузке                   = Ложь;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упСтатусыДокументовWMS.Заблокирован.ПолучитьОбъект();
	текЭлемент.ПрименениеЗаявкаНаПеревозкуГруза = Истина;
	текЭлемент.ПрименениеРейс                   = Ложь;
	текЭлемент.ГотовКОтгрузке                   = Ложь;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упСтатусыДокументовWMS.Обработан.ПолучитьОбъект();
	текЭлемент.ПрименениеЗаявкаНаПеревозкуГруза = Ложь;
	текЭлемент.ПрименениеРейс                   = Ложь;
	текЭлемент.ГотовКОтгрузке                   = Ложь;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упСтатусыДокументовWMS.Завершен.ПолучитьОбъект();
	текЭлемент.ПрименениеЗаявкаНаПеревозкуГруза = Ложь;
	текЭлемент.ПрименениеРейс                   = Ложь;
	текЭлемент.ГотовКОтгрузке                   = Ложь;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упСтатусыДокументовWMS.Скорректирован.ПолучитьОбъект();
	текЭлемент.ПрименениеЗаявкаНаПеревозкуГруза = Ложь;
	текЭлемент.ПрименениеРейс                   = Ложь;
	текЭлемент.ГотовКОтгрузке                   = Ложь;
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упСтатусыДокументовWMS.Доставлен.ПолучитьОбъект();
	текЭлемент.ПрименениеЗаявкаНаПеревозкуГруза = Истина;
	текЭлемент.ПрименениеРейс                   = Истина;
	текЭлемент.ГотовКОтгрузке                   = Ложь;
	текЭлемент.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
